In [1]:
data = {'Name':['John','Tim','Rob'],
       'Age':[34,23,42],
        'Salary':[42000,32000,62000]
       }

In [2]:
from pandas import DataFrame
frame = DataFrame(data)

In [3]:
frame

   Name  Age  Salary
0  John   34   42000
1   Tim   23   32000
2   Rob   42   62000

In [4]:
new_frame = DataFrame(data, columns=['Name','Salary','Age'])

In [5]:
new_frame

   Name  Salary  Age
0  John   42000   34
1   Tim   32000   23
2   Rob   62000   42

In [6]:
frame

   Name  Age  Salary
0  John   34   42000
1   Tim   23   32000
2   Rob   42   62000

In [7]:
new_frame = DataFrame(data, columns=['Name','Salary','Age','Profile'])

In [8]:
new_frame

   Name  Salary  Age Profile
0  John   42000   34     NaN
1   Tim   32000   23     NaN
2   Rob   62000   42     NaN

In [9]:
new_frame['Salary']

0    42000
1    32000
2    62000
Name: Salary, dtype: int64

In [16]:
new_frame.iloc[1]

Name         Tim
Salary     32000
Age           23
Profile      NaN
Name: 1, dtype: object

In [17]:
new_frame['Profile']='Doctor'
new_frame

   Name  Salary  Age Profile
0  John   42000   34  Doctor
1   Tim   32000   23  Doctor
2   Rob   62000   42  Doctor

In [18]:
new_frame = DataFrame(data, columns=['Name','Age','Salary','Profile'])
new_frame

   Name  Age  Salary Profile
0  John   34   42000     NaN
1   Tim   23   32000     NaN
2   Rob   42   62000     NaN

In [19]:
new_frame['Profile']='Doctor'
new_frame

   Name  Age  Salary Profile
0  John   34   42000  Doctor
1   Tim   23   32000  Doctor
2   Rob   42   62000  Doctor

In [20]:
new_frame['Education']='Masters Degree'
new_frame

   Name  Age  Salary Profile       Education
0  John   34   42000  Doctor  Masters Degree
1   Tim   23   32000  Doctor  Masters Degree
2   Rob   42   62000  Doctor  Masters Degree

In [21]:
new_frame['Education']='Ph.D'
new_frame

   Name  Age  Salary Profile Education
0  John   34   42000  Doctor      Ph.D
1   Tim   23   32000  Doctor      Ph.D
2   Rob   42   62000  Doctor      Ph.D

In [23]:
new_frame.iloc[1]

Name            Tim
Age              23
Salary        32000
Profile      Doctor
Education      Ph.D
Name: 1, dtype: object

In [24]:
new_frame = new_frame.T

In [25]:
new_frame

                0       1       2
Name         John     Tim     Rob
Age            34      23      42
Salary      42000   32000   62000
Profile    Doctor  Doctor  Doctor
Education    Ph.D    Ph.D    Ph.D

In [26]:
new_frame = new_frame.T

In [27]:
new_frame

   Name Age Salary Profile Education
0  John  34  42000  Doctor      Ph.D
1   Tim  23  32000  Doctor      Ph.D
2   Rob  42  62000  Doctor      Ph.D

In [28]:
from pandas import Series
obj = Series([100,200,300,400,500], index=['d','a','b','e','c'])
obj

d    100
a    200
b    300
e    400
c    500
dtype: int64

In [31]:
obj = obj.reindex(['a','b','c','d','e'])
obj

a    200
b    300
c    500
d    100
e    400
dtype: int64

In [32]:
data = {'Name':['John','Tim','Rob'],
       'Age':[34,23,42],
        'Salary':[42000,32000,62000]
       }
frame = DataFrame(data)
frame

   Name  Age  Salary
0  John   34   42000
1   Tim   23   32000
2   Rob   42   62000

In [33]:
test_frame = frame.reindex([0,2,1])
test_frame

   Name  Age  Salary
0  John   34   42000
2   Rob   42   62000
1   Tim   23   32000

In [36]:
fields = ['Age','Name','Salary']
hold_frame = test_frame.reindex(columns=fields)
hold_frame

   Age  Name  Salary
0   34  John   42000
2   42   Rob   62000
1   23   Tim   32000

In [37]:
fields = ['Name','Age','Salary']
hold_frame = hold_frame.reindex(columns=fields)
hold_frame

   Name  Age  Salary
0  John   34   42000
2   Rob   42   62000
1   Tim   23   32000

In [38]:
hold = frame.reindex([0,1,2])
hold

   Name  Age  Salary
0  John   34   42000
1   Tim   23   32000
2   Rob   42   62000

In [39]:
hold_frame = hold_frame.reindex([0,1,2])
hold_frame

   Name  Age  Salary
0  John   34   42000
1   Tim   23   32000
2   Rob   42   62000

In [40]:
frame2 = hold_frame.drop([2])
frame2

   Name  Age  Salary
0  John   34   42000
1   Tim   23   32000

In [41]:
frame

   Name  Age  Salary
0  John   34   42000
1   Tim   23   32000
2   Rob   42   62000

In [44]:
frame4 = frame.drop('Salary', axis=1)
frame4

   Name  Age
0  John   34
1   Tim   23
2   Rob   42

In [46]:
from pandas import Series
series1 = Series([1,2,3,4,5])
series2 = Series([100,200,300,400,500,600])
series1 + series2

0    101.0
1    202.0
2    303.0
3    404.0
4    505.0
5      NaN
dtype: float64

In [47]:
from pandas import Series
series1 = Series([1,2,3,4,5,6])
series2 = Series([100,200,300,400,500,600])
series1 + series2

0    101
1    202
2    303
3    404
4    505
5    606
dtype: int64

In [48]:
from pandas import DataFrame
data1 = {'Speed':[100,103,105], 'Temp':[34,23,42],}
frame1 = DataFrame(data1)
frame1

   Speed  Temp
0    100    34
1    103    23
2    105    42

In [49]:
data2 = {'Speed':[101,109,106], 'Temp':[34,23,42], 'Humidity':[45,23,58]}
frame2 = DataFrame(data2)
frame2

   Speed  Temp  Humidity
0    101    34        45
1    109    23        23
2    106    42        58

In [50]:
frame1 + frame2

   Humidity  Speed  Temp
0       NaN    201    68
1       NaN    212    46
2       NaN    211    84

In [51]:
series2 = Series([100,200,300], index=['Speed','Temperature','Humidity'])
series2

Speed          100
Temperature    200
Humidity       300
dtype: int64

In [52]:
frame2 - series2

   Humidity  Speed  Temp  Temperature
0    -255.0    1.0   NaN          NaN
1    -277.0    9.0   NaN          NaN
2    -242.0    6.0   NaN          NaN

In [53]:
frame2
series2

Speed          100
Temperature    200
Humidity       300
dtype: int64

In [54]:
frame2

   Speed  Temp  Humidity
0    101    34        45
1    109    23        23
2    106    42        58

In [57]:
series3 = Series([100,200], index=['Speed','Temp'])
series3

Speed    100
Temp     200
dtype: int64

In [58]:
frame2

   Speed  Temp  Humidity
0    101    34        45
1    109    23        23
2    106    42        58

In [59]:
frame2 - series3

   Humidity  Speed   Temp
0       NaN    1.0 -166.0
1       NaN    9.0 -177.0
2       NaN    6.0 -158.0

In [60]:
frame2 + series3

   Humidity  Speed   Temp
0       NaN  201.0  234.0
1       NaN  209.0  223.0
2       NaN  206.0  242.0

In [62]:
ser = Series([3,7,1,4,7,2], index=[2,7,3,5,9,1])
ser

2    3
7    7
3    1
5    4
9    7
1    2
dtype: int64

In [63]:
ser.sort_index()

1    2
2    3
3    1
5    4
7    7
9    7
dtype: int64

In [64]:
data2 = {'Speed':[101,109,106], 'Temp':[34,23,42], 'Humidity':[45,23,58]}
frame2 = DataFrame(data2)
frame2

   Speed  Temp  Humidity
0    101    34        45
1    109    23        23
2    106    42        58

In [65]:
frame2 = frame2.reindex([2,1,0])
frame2

   Speed  Temp  Humidity
2    106    42        58
1    109    23        23
0    101    34        45

In [66]:
frame2.sort_index()

   Speed  Temp  Humidity
0    101    34        45
1    109    23        23
2    106    42        58

In [68]:
frame2.reindex(columns=['Speed', 'Humidity','Temp'])

   Speed  Humidity  Temp
2    106        58    42
1    109        23    23
0    101        45    34

In [69]:
frame2.sort_index(axis=1)

   Humidity  Speed  Temp
2        58    106    42
1        23    109    23
0        45    101    34

In [72]:
frame2.sort_index(axis=0)

   Speed  Temp  Humidity
0    101    34        45
1    109    23        23
2    106    42        58

In [74]:
frame2

   Speed  Temp  Humidity
2    106    42        58
1    109    23        23
0    101    34        45

In [75]:
frame2 = frame2.reindex([0,1,2])
frame2

   Speed  Temp  Humidity
0    101    34        45
1    109    23        23
2    106    42        58

In [77]:
frame2.sort_index(axis=1,ascending=False)

   Temp  Speed  Humidity
0    34    101        45
1    23    109        23
2    42    106        58

In [78]:
frame2.sort_values()

TypeError: sort_values() missing 1 required positional argument: 'by'

In [79]:
series4 = Series([100,200,300], index=['Speed','Temp','Humidty'])
series4

Speed      100
Temp       200
Humidty    300
dtype: int64

In [80]:
series4.sort_values()

Speed      100
Temp       200
Humidty    300
dtype: int64

In [81]:
frame2

   Speed  Temp  Humidity
0    101    34        45
1    109    23        23
2    106    42        58

In [82]:
frame2.sort_values(by='Humidity')

   Speed  Temp  Humidity
1    109    23        23
0    101    34        45
2    106    42        58

In [83]:
frame2.sort_values(by='Temp')

   Speed  Temp  Humidity
1    109    23        23
0    101    34        45
2    106    42        58

In [84]:
frame2.sort_values(by='Speed')

   Speed  Temp  Humidity
0    101    34        45
2    106    42        58
1    109    23        23

In [86]:
series5 = Series([100,200,300],index=['a','b','b'])
series5

a    100
b    200
b    300
dtype: int64

In [87]:
series5.index.is_unique

False

In [88]:
series5 = Series([100,200,300],index=['a','b','c'])
series5

a    100
b    200
c    300
dtype: int64

In [89]:
series5.index.is_unique

True

In [90]:
frame2

   Speed  Temp  Humidity
0    101    34        45
1    109    23        23
2    106    42        58

In [91]:
frame2.sum()

Speed       316
Temp         99
Humidity    126
dtype: int64

In [92]:
frame2.sum(axis=1)

0    180
1    155
2    206
dtype: int64

In [93]:
frame2.idxmax()

Speed       1
Temp        2
Humidity    2
dtype: int64

In [94]:
frame2.idxmin()

Speed       0
Temp        1
Humidity    1
dtype: int64

In [95]:
import numpy as np
ser = Series([1,2,3,4,np.nan],index=['a','b','c','d','e'])
ser

a    1.0
b    2.0
c    3.0
d    4.0
e    NaN
dtype: float64

In [96]:
ser.dropna()

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [97]:
ser

a    1.0
b    2.0
c    3.0
d    4.0
e    NaN
dtype: float64

In [98]:
ser = ser.dropna()
ser

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [99]:
frame2

   Speed  Temp  Humidity
0    101    34        45
1    109    23        23
2    106    42        58

In [100]:
data2 = {'Speed':[101,np.nan,106], 'Temp':[34,np.nan,42], 'Humidity':[45,np.nan,58]}
frame3 = DataFrame(data2)
frame3

   Speed  Temp  Humidity
0  101.0  34.0      45.0
1    NaN   NaN       NaN
2  106.0  42.0      58.0

In [101]:
frame3.dropna()

   Speed  Temp  Humidity
0  101.0  34.0      45.0
2  106.0  42.0      58.0

In [102]:
frame3 = frame3.dropna()
frame3

   Speed  Temp  Humidity
0  101.0  34.0      45.0
2  106.0  42.0      58.0

In [103]:
data2 = {'Speed':[101,np.nan,106], 'Temp':[34,np.nan,42], 'Humidity':[45,np.nan,58]}
frame3 = DataFrame(data2)
frame3

   Speed  Temp  Humidity
0  101.0  34.0      45.0
1    NaN   NaN       NaN
2  106.0  42.0      58.0

In [105]:
frame3.fillna(0)

   Speed  Temp  Humidity
0  101.0  34.0      45.0
1    0.0   0.0       0.0
2  106.0  42.0      58.0

In [106]:
import pandas
data_frame = pandas.read_csv("test.csv")
data_frame

,Unnamed: 0,order_id,product_name,product_price,customer_name,product_category,brand
0,NaN,459741,MacBook Air,955,James,electronics,apple
1,NaN,846145,Iphone 6,900,Tim,electronics,apple
2,NaN,648931,hp wireless mouse,10,James,electronics,hp
3,NaN,746512,lg ips monitor,200,Rob,electronics,lg
4,NaN,546412,samsung led tv,500,John,electronics,samsung
5,NaN,884431,philips hair dryer,10,James,electronics,philips
6,NaN,431237,samsung tab 3,300,James,electronics,samsung
7,NaN,701436,haier air conditioner,600,John,electronics,haier
8,NaN,904716,blender,73,Harry,electronics,blendtech
9,NaN,304864,Dell Inspirion Laptop,699,Rohn,electronics,dell
10,NaN,546168,Dell Keyboard,20,Rob,electronics,dell

In [108]:
data_frame2 = data_frame.fillna(0)
data_frame2

,Unnamed: 0,order_id,product_name,product_price,customer_name,product_category,brand
0,0.0,459741,MacBook Air,955,James,electronics,apple
1,0.0,846145,Iphone 6,900,Tim,electronics,apple
2,0.0,648931,hp wireless mouse,10,James,electronics,hp
3,0.0,746512,lg ips monitor,200,Rob,electronics,lg
4,0.0,546412,samsung led tv,500,John,electronics,samsung
5,0.0,884431,philips hair dryer,10,James,electronics,philips
6,0.0,431237,samsung tab 3,300,James,electronics,samsung
7,0.0,701436,haier air conditioner,600,John,electronics,haier
8,0.0,904716,blender,73,Harry,electronics,blendtech
9,0.0,304864,Dell Inspirion Laptop,699,Rohn,electronics,dell
10,0.0,546168,Dell Keyboard,20,Rob,electronics,dell

In [110]:
from pandas import DataFrame
data_frame = DataFrame(data_frame, columns=['order_id','product_name','product_price','customer_name','product_category','brand'])
data_frame

,order_id,product_name,product_price,customer_name,product_category,brand
0,459741,MacBook Air,955,James,electronics,apple
1,846145,Iphone 6,900,Tim,electronics,apple
2,648931,hp wireless mouse,10,James,electronics,hp
3,746512,lg ips monitor,200,Rob,electronics,lg
4,546412,samsung led tv,500,John,electronics,samsung
5,884431,philips hair dryer,10,James,electronics,philips
6,431237,samsung tab 3,300,James,electronics,samsung
7,701436,haier air conditioner,600,John,electronics,haier
8,904716,blender,73,Harry,electronics,blendtech
9,304864,Dell Inspirion Laptop,699,Rohn,electronics,dell
10,546168,Dell Keyboard,20,Rob,electronics,dell

In [111]:
data_frame = data_frame.drop([1])
data_frame

,order_id,product_name,product_price,customer_name,product_category,brand
0,459741,MacBook Air,955,James,electronics,apple
2,648931,hp wireless mouse,10,James,electronics,hp
3,746512,lg ips monitor,200,Rob,electronics,lg
4,546412,samsung led tv,500,John,electronics,samsung
5,884431,philips hair dryer,10,James,electronics,philips
6,431237,samsung tab 3,300,James,electronics,samsung
7,701436,haier air conditioner,600,John,electronics,haier
8,904716,blender,73,Harry,electronics,blendtech
9,304864,Dell Inspirion Laptop,699,Rohn,electronics,dell
10,546168,Dell Keyboard,20,Rob,electronics,dell

In [113]:
data_frame = data_frame.drop('product_category',axis=1)
data_frame

    order_id           product_name  product_price customer_name      brand
0     459741            MacBook Air            955         James      apple
2     648931      hp wireless mouse             10         James         hp
3     746512         lg ips monitor            200           Rob         lg
4     546412         samsung led tv            500          John    samsung
5     884431     philips hair dryer             10         James    philips
6     431237          samsung tab 3            300         James    samsung
7     701436  haier air conditioner            600          John      haier
8     904716                blender             73         Harry  blendtech
9     304864  Dell Inspirion Laptop            699          Rohn       dell
10    546168          Dell Keyboard             20           Rob       dell

In [114]:
data_frame.sort_values(by='product_price')

    order_id           product_name  product_price customer_name      brand
2     648931      hp wireless mouse             10         James         hp
5     884431     philips hair dryer             10         James    philips
10    546168          Dell Keyboard             20           Rob       dell
8     904716                blender             73         Harry  blendtech
3     746512         lg ips monitor            200           Rob         lg
6     431237          samsung tab 3            300         James    samsung
4     546412         samsung led tv            500          John    samsung
7     701436  haier air conditioner            600          John      haier
9     304864  Dell Inspirion Laptop            699          Rohn       dell
0     459741            MacBook Air            955         James      apple

In [115]:
data_frame.sum(numeric_only=True)

order_id         6174448
product_price       3367
dtype: int64